In [5]:
import numpy as np

In [6]:
import pandas as pd

In [4]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [8]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [11]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(arr,d)

a    10
b    20
c    30
dtype: int32

In [16]:
pd.Series(data)

0    a
1    b
2    c
dtype: object

In [17]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [19]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [20]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [24]:
ser2 = pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])

In [25]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [26]:
ser2['Japan']

4

In [29]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [30]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [31]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [32]:

# Part 2

In [33]:
from numpy.random import randn

In [39]:
df = pd.DataFrame(data = randn(5,4),index = ['A','B','C','D','E'],columns = ['W','X','y','Z'])

In [44]:
type(df)

pandas.core.frame.DataFrame

In [45]:
df

          W         X         y         Z
A -2.374789  0.424339 -1.022728  0.809803
B -1.655171 -1.395621  3.096216  0.726858
C  1.220260  2.043750 -2.214259  2.356057
D  0.133056  0.449853  0.232765  1.051566
E -0.012724  0.606737 -0.081071 -1.722562

In [46]:
df['W']

A   -2.374789
B   -1.655171
C    1.220260
D    0.133056
E   -0.012724
Name: W, dtype: float64

In [48]:
df[['X','Z']]

          X         Z
A  0.424339  0.809803
B -1.395621  0.726858
C  2.043750  2.356057
D  0.449853  1.051566
E  0.606737 -1.722562

In [50]:
df['new'] = df['W']+df['y']

In [51]:
df

          W         X         y         Z       new
A -2.374789  0.424339 -1.022728  0.809803 -3.397517
B -1.655171 -1.395621  3.096216  0.726858  1.441045
C  1.220260  2.043750 -2.214259  2.356057 -0.993999
D  0.133056  0.449853  0.232765  1.051566  0.365821
E -0.012724  0.606737 -0.081071 -1.722562 -0.093795

In [52]:
df.drop('W',axis=1)

          X         y         Z       new
A  0.424339 -1.022728  0.809803 -3.397517
B -1.395621  3.096216  0.726858  1.441045
C  2.043750 -2.214259  2.356057 -0.993999
D  0.449853  0.232765  1.051566  0.365821
E  0.606737 -0.081071 -1.722562 -0.093795

In [57]:
df.drop('A',axis=0,inplace=True)

In [59]:
df

          W         X         y         Z       new
B -1.655171 -1.395621  3.096216  0.726858  1.441045
C  1.220260  2.043750 -2.214259  2.356057 -0.993999
D  0.133056  0.449853  0.232765  1.051566  0.365821
E -0.012724  0.606737 -0.081071 -1.722562 -0.093795

In [60]:
df.shape

(4, 5)

In [62]:
df

          W         X         y         Z       new
B -1.655171 -1.395621  3.096216  0.726858  1.441045
C  1.220260  2.043750 -2.214259  2.356057 -0.993999
D  0.133056  0.449853  0.232765  1.051566  0.365821
E -0.012724  0.606737 -0.081071 -1.722562 -0.093795

In [66]:
df.loc['B']

W     -1.655171
X     -1.395621
y      3.096216
Z      0.726858
new    1.441045
Name: B, dtype: float64

In [70]:
df.iloc[2][2]

0.23276467831689351

In [71]:
df.loc['D']['y']

0.23276467831689351

In [74]:
df.loc[['C','D']][['X','y']]

          X         y
C  2.043750 -2.214259
D  0.449853  0.232765

In [80]:
df.iloc[1:3,1:3]

          X         y
C  2.043750 -2.214259
D  0.449853  0.232765

In [81]:
df

          W         X         y         Z       new
B -1.655171 -1.395621  3.096216  0.726858  1.441045
C  1.220260  2.043750 -2.214259  2.356057 -0.993999
D  0.133056  0.449853  0.232765  1.051566  0.365821
E -0.012724  0.606737 -0.081071 -1.722562 -0.093795

In [82]:
df[df>0]

          W         X         y         Z       new
B       NaN       NaN  3.096216  0.726858  1.441045
C  1.220260  2.043750       NaN  2.356057       NaN
D  0.133056  0.449853  0.232765  1.051566  0.365821
E       NaN  0.606737       NaN       NaN       NaN

In [92]:
df[df['W']>0 ]

          W         X         y         Z       new
C  1.220260  2.043750 -2.214259  2.356057 -0.993999
D  0.133056  0.449853  0.232765  1.051566  0.365821

In [104]:
r=df['X']>0
df[r][['W','y']]

          W         y
C  1.220260 -2.214259
D  0.133056  0.232765
E -0.012724 -0.081071

In [105]:

#part 3

In [106]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [108]:
df = pd.DataFrame(d)

In [124]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [126]:
#drop the nan value
df.dropna()

     A    B  C
0  1.0  5.0  1

In [133]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [137]:
df.dropna(axis=1,thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [139]:
df.fillna(value='Fill')

      A     B  C
0     1     5  1
1     2  Fill  2
2  Fill  Fill  3

In [141]:
df['A'].fillna(value=1.5)

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [143]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [144]:

# part 3

In [7]:

data = {'Company':['GOOG','GOOG','MSFT','MDFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]
       }

In [8]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MDFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MDFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [14]:
bydf = df.groupby('Company')

In [15]:
bydf.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MDFT     124.0
MSFT     340.0

In [16]:
bydf.sum()

         Sales
Company
FB         593
GOOG       320
MDFT       124
MSFT       340

In [20]:
bydf.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [21]:
bydf.std()

             Sales
Company
FB       75.660426
GOOG     56.568542
MDFT           NaN
MSFT           NaN

In [19]:
bydf.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MDFT          1      1
MSFT          1      1

In [23]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MDFT     Vanessa    124
MSFT         Amy    340

In [24]:
df.groupby('Company').describe()

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
FB        2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0
MDFT      1.0  124.0        NaN  124.0  124.00  124.0  124.00  124.0
MSFT      1.0  340.0        NaN  340.0  340.00  340.0  340.00  340.0

In [26]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [27]:
#part 4

In [28]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                    index = [0,1,2,3])

In [29]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                  index = [4,5,6,7])

In [30]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                  index=[8,9,10,11])

In [31]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [32]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [33]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [34]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [36]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [37]:
left = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'key':['K0','K1','K2','K3']})

right = pd.DataFrame({'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3'],
                    'key':['K0','K1','K2','K3']})

In [38]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [39]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [43]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [44]:
left = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'key1':['K0','K0','K1','K2'],
                    'key2':['K0','K1','K0','K1']})

right = pd.DataFrame({'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3'],
                    'key1':['K0','K1','K1','K2'],
                    'key2':['K0','K0','K0','K0']})

In [46]:
left

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [48]:
pd.merge(left,right,on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [51]:
pd.merge(left,right,how='outer',on=['key1','key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [52]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                    'B':['B0','B1','B2']},
                    index=['K0','K1','K2'])

right = pd.DataFrame({'C':['C0','C2','C3'],
                    'D':['D0','D2','D3']},
                    index=['K0','K2','K3'])

In [53]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [56]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [57]:

# part 4

In [58]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [61]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [64]:
len(df['col2'].unique())

3

In [65]:
df['col2'].nunique()

3

In [66]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [68]:
df[(df['col1']>2) & ( df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [71]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [72]:
def times2(x):
    return x*2

In [73]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [75]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [76]:
df['col4'] = df['col1'] + df['col2']

In [80]:
df.drop('col1',axis=1,inplace=True)

In [81]:
df

   col2 col3  col4
0   444  abc   445
1   555  def   557
2   666  ghi   669
3   444  xyz   448

In [82]:
df.columns

Index(['col2', 'col3', 'col4'], dtype='object')

In [83]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [84]:
df.sort_values(by='col2')

   col2 col3  col4
0   444  abc   445
3   444  xyz   448
1   555  def   557
2   666  ghi   669

In [85]:
df.isnull()

    col2   col3   col4
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [86]:
df = pd.DataFrame({'A':['foo','foo','foo','bar','bar','bar'],
                   'B':['one','one','two','two','one','one'],
                   'C':['x','y','x','y','x','y'],
                   'D':[1,3,2,5,4,1]
                  })

In [88]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [89]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [90]:


# part 5

In [91]:
pwd

'C:\\Users\\Aquib'

In [94]:
df = pd.read_csv('example.csv')

In [111]:
df.to_csv('My_output',index=False)

In [112]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [114]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

C:\Users\Aquib\Anaconda3\lib\site-packages\pandas\io\excel.py:329: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  **kwds)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [115]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

In [117]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [124]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"
5,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","March 7, 2018"
6,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","May 18, 2017"
7,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","May 18, 2017"
8,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","September 25, 2017"
9,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","June 1, 2017"
10,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
11,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
12,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","March 13, 2017"
13,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","February 19, 2018"
14,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","July 9, 2018"
15,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","February 20, 2018"
16,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","July 12, 2016"
17,Doral Bank En Espanol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015","May 13, 2015"
18,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015","April 21, 2015"
19,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015","November 15, 2017"
20,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015","November 15, 2017"
21,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014","January 3, 2018"
22,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014","November 10, 2016"
23,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014","January 6, 2016"
24,NBRS Financial,Rising Sun,MD,4862,Howard Bank,"October 17, 2014","February 19, 2018"
25,"GreenChoice Bank, fsb",Chicago,IL,28462,"Providence Bank, LLC","July 25, 2014","December 12, 2016"
26,Eastside Commercial Bank,Conyers,GA,58125,Community & Southern Bank,"July 18, 2014","October 6, 2017"
27,The Freedom State Bank,Freedom,OK,12483,Alva State Bank & Trust Company,"June 27, 2014","February 21, 2018"
28,Valley Bank,Fort Lauderdale,FL,21793,"Landmark Bank, National Association","June 20, 2014","February 14, 2018"
29,Valley Bank,Moline,IL,10450,Great Southern Bank,"June 20, 2014","June 26, 2015"
...,...,...,...,...,...,...,...
525,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008","August 28, 2012"
526,Hume Bank,Hume,MO,1971,Security Bank,"March 7, 2008","August 28, 2012"
527,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,"January 25, 2008","October 26, 2012"
528,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,"October 4, 2007","September 12, 2016"
529,NetBank,Alpharetta,GA,32575,ING DIRECT,"September 28, 2007","August 28, 2012"
530,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,"February 2, 2007","October 27, 2010"
531,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,"June 25, 2004","April 9, 2008"
532,Reliance Bank,White Plains,NY,26778,Union State Bank,"March 19, 2004","April 9, 2008"
533,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004","April 17, 2018"
534,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,"February 14, 2004","April 9, 2008"
535,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,"November 14, 2003","October 6, 2017"
536,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,"May 9, 2003","June 5, 2012"
537,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,"February 7, 2003","October 20, 2008"
538,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,"December 17, 2002","October 20, 2004"
539,Bank of Alamo,Alamo,TN,9961,No Acquirer,"November 8, 2002","March 18, 2005"
540,AmTrade International Bank En Espanol,Atlanta,GA,33784,No Acquirer,"September 30, 2002","September 11, 2006"
541,Universal Federal Savings Bank,Chicago,IL,29355,Chicago Community Bank,"June 27, 2002","October 6, 2017"
542,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,"June 26, 2002","February 14, 2012"
543,New Century Bank,Shelby Township,MI,34979,No Acquirer,"March 28, 2002","March 18, 2005"
544,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002","April 9, 2008"
545,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,"February 7, 2002","February 5, 2015"
546,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,"February 1, 2002","October 25, 2012"
547,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,"January 18, 2002","November 6, 2003"
548,"Hamilton Bank, NA En Espanol",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002","September 21, 2015"
549,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001","October 6, 2017"
550,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
551,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
552,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
553,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
554,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [121]:
from sqlalchemy import create_engine

In [125]:
engine = create_engine('sqlite:///:memory:')

In [126]:
df.to_sql('my_table',engine)

In [127]:
sqldf = pd.read_sql('my_table',engine)

In [128]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15